{
    "1": {
        "id": "phase_1",
        "name": "Phase 1: Market Fit & Strategy",
        "description": "Define the critical pain points, unique value proposition, and competitive advantage of EG's professional services AI solution.",
        "weight": 0.3,
        "time_limit_seconds": 600,
        "contributors": "Managing Partners, Practice Leaders, Resource Managers, Operations Directors",
        "questions": [
            {
                "id": "q1_1",
                "text": "What specific pain point are we solving that the customer cannot efficiently address today?",
                "criteria": "Delivery predictability limitations, resource utilization inefficiency, margin erosion invisibility, utilization optimization difficulty, engagement profitability blindness",
                "focus": "Identify the inability to predict delivery issues and optimize resource deployment while protecting engagement margins.",
                "hint_text": "Describe how practice leaders discover engagement delivery problems only when clients express dissatisfaction. Mention the challenge of optimizing resource allocation across dozens of simultaneous projects. Explain the invisible margin erosion from scope creep and inefficient resource deployment that appears only in delayed financial reports.",
                "ideal_answer": "Professional services firms operate with limited visibility into engagement health, discovering delivery problems only when clients escalate concerns or project reviews reveal scope creep and timeline slippage that have already damaged relationships. Practice leaders cannot effectively optimize resource allocation across numerous simultaneous engagements—consultant utilization, skill matching, capacity planning—resulting in underutilized talent, overcommitted teams, and project staffing that compromises delivery quality or profitability. Margin erosion occurs invisibly through scope expansion, inefficient work patterns, and resource deployment misalignments that financial reports reveal only after opportunities for correction have passed. Firms lack tools to predict which engagements face delivery risk or margin pressure early enough for effective intervention. This reactive approach results in client dissatisfaction damaging relationships and references, reduced profitability from unmanaged scope and inefficient delivery, consultant burnout from poor capacity management, and competitive disadvantage as rivals deliver more predictably and profitably.",
                "hint_penalty": 25
            },
            {
                "id": "q1_2",
                "text": "What measurable value will the customer realize, and how quickly?",
                "criteria": "Utilization rate improvement, engagement margin enhancement, delivery predictability increase, client satisfaction gains, resource optimization effectiveness",
                "focus": "Quantify predictive delivery management impact on margins and utilization with clear client satisfaction benefits.",
                "hint_text": "Focus on how early engagement risk identification enables intervention protecting margins and delivery quality. Mention utilization optimization across the consultant base. Emphasize both profitability improvement and client relationship strengthening from reliable delivery.",
                "ideal_answer": "Practice leaders gain real-time visibility into engagement health across the portfolio, with early warning signals identifying delivery risks, margin pressures, and resource optimization opportunities before they impact outcomes. Project managers intervene proactively when scope drift or inefficient work patterns threaten profitability, protecting engagement margins through timely adjustments. Resource management becomes more strategic as the platform identifies utilization optimization opportunities—underdeployed consultants available for new work, overcommitted teams requiring rebalancing, skill gaps requiring attention. Client satisfaction improves through more predictable delivery and proactive communication when challenges arise. The financial impact manifests through enhanced engagement margins from controlled scope and efficient delivery, improved consultant utilization rates maximizing revenue capacity, strengthened client relationships driving repeat business and referrals, and better strategic decision-making about engagement acceptance and resource investment.",
                "hint_penalty": 25
            },
            {
                "id": "q1_3",
                "text": "Why is EG the right partner? What differentiates EG?",
                "criteria": "Professional services AI specialization, engagement health modeling sophistication, resource optimization intelligence, margin protection capability, consulting operations expertise",
                "focus": "Highlight professional services expertise and comprehensive delivery intelligence that generic tools cannot provide.",
                "hint_text": "Highlight AI trained on professional services engagement patterns versus generic project tracking tools. Contrast sophisticated engagement health analysis with simple time tracking. Emphasize understanding of consulting business models, margin dynamics, and resource management challenges.",
                "ideal_answer": "The solution delivers superior predictive accuracy through AI purpose-built for professional services contexts, trained on diverse engagement types, delivery models, and organizational structures rather than generic project management tools adapted for consulting. Unlike basic time tracking and financial reporting that show historical results, the platform analyzes complex patterns across engagement activity, resource deployment, client interaction signals, and scope evolution—identifying delivery risks and margin pressures before they materialize. The differentiation extends to intelligent resource optimization that balances utilization, skill development, and engagement quality rather than simply maximizing billable hours. Deep professional services expertise ensures implementation aligns with practice management workflows, engagement governance processes, and client relationship priorities. The system continuously learns from engagement outcomes, improving prediction accuracy and optimization recommendations as it understands firm-specific patterns and market dynamics.",
                "hint_penalty": 25
            }
        ]
    },
    "2": {
        "id": "phase_2",
        "name": "Phase 2: Product & Experience",
        "description": "Detail the integration, user journey, and trust mechanisms that ensure user adoption and confidence.",
        "weight": 0.3,
        "time_limit_seconds": 600,
        "contributors": "Managing Partners, Practice Leaders, Resource Managers, Operations Directors",
        "questions": [
            {
                "id": "q2_1",
                "text": "How does the solution integrate into their existing workflows and systems?",
                "criteria": "Professional services automation connectivity, time tracking integration, financial system synchronization, client relationship data access, resource management compatibility",
                "focus": "Detail seamless connection to existing consulting systems and delivery insight delivery within current workflows.",
                "hint_text": "Explain connections to professional services automation platforms, time and expense systems, and financial reporting tools. Mention client communication and engagement documentation integration. Describe how engagement health insights flow into practice leader dashboards and project review meetings.",
                "ideal_answer": "The platform integrates seamlessly with existing professional services automation systems, time and expense tracking tools, and financial platforms through standard consulting technology connectors, automatically ingesting engagement data, resource allocation, budget tracking, and billing information without duplicate entry. Client relationship data, engagement documentation, and communication history enrich analysis with qualitative signals about satisfaction and scope alignment. Engagement health insights and resource optimization recommendations deliver directly into practice leader dashboards, project manager interfaces, and resource management tools teams use for daily operations. Integration with scheduling platforms enables intelligent resource deployment across the engagement portfolio. The architecture supports both engagement-level tactical delivery management and firm-level strategic resource planning, ensuring consulting professionals access intelligence within established workflows and familiar systems.",
                "hint_penalty": 25
            },
            {
                "id": "q2_2",
                "text": "What does the user experience look like for different stakeholders or personas at the customer?",
                "criteria": "Project manager engagement clarity, practice leader portfolio visibility, resource manager allocation intelligence, partner financial oversight, consultant utilization transparency",
                "focus": "Compare actionable project manager delivery alerts with strategic partner portfolio performance dashboards.",
                "hint_text": "Describe engagement health alerts for project managers with specific intervention recommendations versus portfolio analytics for practice leaders. Explain resource manager optimization tools and partner dashboards quantifying margin performance and utilization effectiveness.",
                "ideal_answer": "Project managers receive engagement health alerts identifying delivery risks, scope drift patterns, or margin pressures with specific recommendations—budget reforecasting needed, client expectation realignment required, resource adjustment opportunities—enabling proactive management without extensive analysis. Practice leaders view portfolio dashboards showing engagement health across all projects, resource utilization patterns, and margin performance trends informing strategic decisions about engagement acceptance and staffing. Resource managers access optimization tools identifying deployment opportunities, utilization gaps, and capacity constraints across the consultant base, enabling strategic allocation decisions. Partners see financial performance analytics quantifying engagement profitability, practice area margins, and utilization effectiveness with client satisfaction context. Consultants access personal utilization dashboards providing transparency into their deployment, professional development opportunities, and contribution to firm success.",
                "hint_penalty": 25
            },
            {
                "id": "q2_3",
                "text": "What safeguards and controls give them confidence in the AI's outputs?",
                "criteria": "Health factor transparency, prediction confidence indication, client context consideration, override capabilities, performance validation, sensitivity analysis availability",
                "focus": "Explain engagement health driver transparency and professional judgment primacy that build confidence in recommendations.",
                "hint_text": "Highlight how the system shows which specific engagement factors are driving health assessments and risk predictions. Describe project manager override authority maintaining client relationship judgment. Explain performance tracking validating prediction accuracy against actual engagement outcomes.",
                "ideal_answer": "Every engagement health assessment includes transparent reasoning showing which specific factors are driving conclusions—budget burn rate patterns, scope change velocity, client communication signals, resource efficiency trends—enabling project managers to validate the analysis based on their client relationship knowledge. Predictions include confidence scoring reflecting data completeness and engagement complexity, with lower-confidence assessments clearly flagged for additional review. Project managers and practice leaders retain complete authority to override recommendations, applying their professional judgment and client context that quantitative analysis cannot fully capture. Scenario analysis tools enable exploration of how different interventions affect engagement outcomes and profitability. Performance tracking compares predictions against actual engagement results, validating accuracy over time and building confidence through demonstrated reliability. Client relationship sensitivity ensures recommendations balance financial optimization with relationship preservation, respecting the primacy of long-term client value.",
                "hint_penalty": 25
            }
        ]
    },
    "3": {
        "id": "phase_3",
        "name": "Phase 3: Execution & Scale",
        "description": "Outline the roadmap for success, evidence of performance, and the support model for organizational-wide rollout.",
        "weight": 0.4,
        "time_limit_seconds": 600,
        "contributors": "Managing Partners, Practice Leaders, Resource Managers, Operations Directors",
        "questions": [
            {
                "id": "q3_1",
                "text": "What does success look like at 90 days, 6 months, and 12 months?",
                "criteria": "Pilot practice validation, firm-wide expansion, organizational capability building, measurable performance transformation, cultural evolution",
                "focus": "Map pilot practice validation milestones toward enterprise-wide intelligent delivery management transformation.",
                "hint_text": "Define progression from pilot practice with validated insights to firm-wide deployment to organizational delivery excellence standard. Show evolution from tactical engagement management to strategic operational excellence capability.",
                "ideal_answer": "At the initial milestone, success means validating insights in a pilot practice area with measurable improvement in engagement margin protection, documented utilization optimization, and leader confidence in recommendations. Expansion phase success involves scaling across all practice areas and service lines with delivery intelligence fully integrated into engagement governance and resource management processes, demonstrating value across diverse client types and engagement models. Full maturity represents the platform functioning as the firm-wide standard for delivery management, with data-driven operational excellence embedded in organizational culture. Leadership reports substantial margin improvement across the engagement portfolio, enhanced consultant utilization rates maximizing revenue capacity, improved client satisfaction and retention, strengthened competitive positioning through reliable delivery enabling premium pricing, and transformation from reactive project management to proactive delivery optimization that drives sustainable profitability growth and market leadership.",
                "hint_penalty": 25
            },
            {
                "id": "q3_2",
                "text": "What evidence do we have that this works for companies like them?",
                "criteria": "Professional services sector relevance, organizational scale similarity, validated performance metrics, client feedback, industry recognition",
                "focus": "Reference comparable professional services firm results and independently validated margin and delivery improvements.",
                "hint_text": "Mention deployments at similar consulting or professional services firms with comparable service offerings. Describe validated margin improvements and utilization gains. Reference client satisfaction improvements or industry recognition of operational excellence.",
                "ideal_answer": "The platform has proven success in professional services firms similar to yours, with documented implementations across consulting, advisory, and specialized services organizations of comparable scale and service complexity. Reference firms report measurable engagement margin improvements and consultant utilization gains, with outcomes validated through financial analysis confirming profitability enhancement. Client satisfaction improvements are documented through relationship surveys and retention metrics. Several organizations have received industry recognition for operational excellence and delivery innovation. The approach has delivered consistent results across diverse professional services contexts—management consulting, technology advisory, financial services, specialized expertise—demonstrating effectiveness across different business models and client relationship structures. Professional services references are available to discuss their transformation to predictive delivery management, the cultural evolution toward data-driven operations, and the competitive advantage they have gained through superior margin performance and delivery reliability.",
                "hint_penalty": 25
            },
            {
                "id": "q3_3",
                "text": "How will we support them through adoption and scale?",
                "criteria": "Dedicated implementation support, leadership training programs, technical assistance accessibility, continuous optimization process, executive success reviews",
                "focus": "Outline dedicated professional services team support and comprehensive practice leader enablement programs.",
                "hint_text": "Detail implementation support from consulting operations and practice management experts. Describe project manager and practice leader training. Explain continuous model refinement and regular reviews tracking margin and utilization impact.",
                "ideal_answer": "Your practice leadership receives dedicated implementation support from specialists combining data science expertise and professional services operations experience, configuring analytics for your specific service offerings, engagement models, and organizational structure. Comprehensive training prepares project managers to leverage engagement health insights for delivery management, practice leaders to use portfolio intelligence for strategic decisions, and resource managers to optimize consultant deployment. Partners learn to interpret financial performance analytics within client relationship context. Continuous technical support provides rapid assistance whenever questions arise during engagement management or resource planning. Regular optimization sessions analyze prediction performance across completed engagements, refine models based on your firm's evolving service mix and client base, and identify new optimization opportunities. Executive business reviews track key metrics—engagement margins, utilization rates, client satisfaction, delivery predictability—ensuring leadership maintains visibility into how intelligent delivery management is strengthening operational performance, profitability, and competitive positioning.",
                "hint_penalty": 25
            }
        ]
    }
}
