{
    "1": {
        "id": "phase_1",
        "name": "Phase 1: Market Fit & Strategy",
        "description": "Define the critical pain points, unique value proposition, and competitive advantage of EG's hospitality AI solution.",
        "weight": 0.3,
        "time_limit_seconds": 600,
        "contributors": "General Manager, VP of Guest Experience, Operations Director, Head of Loyalty",
        "questions": [
            {
                "id": "q1_1",
                "text": "What specific pain point are we solving that the customer cannot efficiently address today?",
                "criteria": "Generic service delivery limitations, guest preference invisibility, reactive issue resolution, personalization scalability constraints, operational efficiency gaps",
                "focus": "Identify the inability to personalize guest experiences at scale while managing operational workload efficiently.",
                "hint_text": "Describe how hotels deliver generic service unable to anticipate individual guest preferences. Mention staff overwhelmed by service decisions without guest context. Explain the reactive approach discovering satisfaction issues only through post-stay surveys when recovery is impossible.",
                "ideal_answer": "Hospitality operators struggle to deliver personalized experiences at scale, treating guests generically despite data scattered across reservation systems, loyalty programs, and service interactions that could inform individualized service. Front desk and service staff make decisions without guest preference context—room assignment, amenity offerings, service timing—missing opportunities to exceed expectations. Teams operate reactively, discovering dissatisfaction through post-stay surveys when relationship recovery becomes difficult and costly. Staff face overwhelming operational decisions throughout each shift without intelligent guidance, leading to inconsistent service quality and burnout. Personalization attempts remain manual and inconsistent, dependent on individual staff memory rather than systematic intelligence. This generic approach results in missed revenue from upsell opportunities guests would value, lower satisfaction scores affecting reputation and loyalty, competitive disadvantage as guests choose properties offering superior personalization, and operational inefficiency from manual decision-making.",
                "hint_penalty": 25
            },
            {
                "id": "q1_2",
                "text": "What measurable value will the customer realize, and how quickly?",
                "criteria": "Guest satisfaction improvement, revenue per guest increase, operational efficiency gains, staff workload reduction, loyalty program effectiveness enhancement",
                "focus": "Quantify personalization impact on satisfaction and revenue with clear operational efficiency benefits.",
                "hint_text": "Focus on how automated personalization improves guest satisfaction while reducing staff decision burden. Mention revenue lift from relevant upsell recommendations. Emphasize dual benefit of enhanced experience and operational efficiency.",
                "ideal_answer": "Hotels experience immediate guest satisfaction improvements as the system personalizes service delivery based on preferences, history, and real-time context—room assignments matching preferences, amenity offerings aligned with interests, service timing respecting guest patterns. Staff efficiency increases as intelligent recommendations guide service decisions, reducing cognitive load and enabling focus on relationship building rather than administrative choices. Revenue per guest improves through relevant upsell recommendations presented at optimal moments when guests are receptive. Loyalty program effectiveness strengthens as personalization demonstrates member value beyond transactional benefits. The financial impact manifests through improved satisfaction scores driving online reputation and booking conversion, increased ancillary revenue from personalized offerings, enhanced staff productivity, and strengthened guest lifetime value through loyalty and repeat business.",
                "hint_penalty": 25
            },
            {
                "id": "q1_3",
                "text": "Why is EG the right partner? What differentiates EG?",
                "criteria": "Hospitality AI specialization, preference learning sophistication, real-time context awareness, service automation intelligence, guest experience expertise",
                "focus": "Highlight hospitality domain expertise and intelligent service automation that generic systems cannot deliver.",
                "hint_text": "Highlight AI trained on hospitality guest behavior versus generic recommendation engines. Contrast context-aware personalization with static preference profiles. Emphasize understanding of hotel operations and service delivery workflows.",
                "ideal_answer": "The solution delivers superior personalization through AI purpose-built for hospitality contexts, trained on diverse guest behaviors and service scenarios rather than generic recommendation systems adapted for hotels. Unlike static preference profiles that miss evolving needs, the platform learns continuously from guest interactions, understanding context like trip purpose, travel companions, and real-time sentiment that informs service appropriateness. The differentiation extends to intelligent service automation that doesn't just personalize but also optimizes operational decisions—room inventory allocation, staffing deployment, amenity timing—balancing guest experience with operational efficiency. Deep hospitality expertise ensures implementation aligns with property operations, service standards, and brand positioning. The system respects service culture, augmenting rather than replacing human hospitality while enabling staff to deliver more personalized experiences efficiently.",
                "hint_penalty": 25
            }
        ]
    },
    "2": {
        "id": "phase_2",
        "name": "Phase 2: Product & Experience",
        "description": "Detail the integration, user journey, and trust mechanisms that ensure user adoption and confidence.",
        "weight": 0.3,
        "time_limit_seconds": 600,
        "contributors": "General Manager, VP of Guest Experience, Operations Director, Head of Loyalty",
        "questions": [
            {
                "id": "q2_1",
                "text": "How does the solution integrate into their existing workflows and systems?",
                "criteria": "Property management system connectivity, guest data platform integration, point-of-sale synchronization, communication platform compatibility, staff workflow embedding",
                "focus": "Detail seamless connection to existing hospitality systems and personalization delivery within current service workflows.",
                "hint_text": "Explain connections to property management systems, customer relationship platforms, and service request tools. Mention real-time guest data synthesis across touchpoints. Describe how personalization guidance flows to staff through existing interfaces during service delivery.",
                "ideal_answer": "The platform integrates seamlessly with existing property management systems, guest data platforms, and point-of-sale systems through standard hospitality connectors, automatically synthesizing guest preferences, reservation details, loyalty status, and interaction history without manual data consolidation. Real-time integration captures service touchpoints—dining orders, spa bookings, concierge requests—enriching guest understanding continuously throughout stays. Personalization recommendations and service guidance deliver directly to staff interfaces—front desk terminals, mobile devices, service department systems—within existing workflows rather than requiring separate application monitoring. Integration with communication platforms enables personalized messaging through guest-preferred channels, and the architecture synchronizes with revenue management systems to balance personalization with pricing strategy, ensuring staff deliver exceptional experiences within familiar operational processes.",
                "hint_penalty": 25
            },
            {
                "id": "q2_2",
                "text": "What does the user experience look like for different stakeholders or personas at the customer?",
                "criteria": "Front desk guidance clarity, service staff recommendation relevance, guest services personalization insight, operations manager performance visibility, general manager strategic oversight",
                "focus": "Compare actionable front desk personalization guidance with strategic general manager guest satisfaction dashboards.",
                "hint_text": "Describe personalized service recommendations for front desk during check-in versus operational insights for managers. Explain concierge and dining staff guidance and executive dashboards quantifying satisfaction improvement and revenue impact.",
                "ideal_answer": "Front desk staff receive contextual guidance during check-in—room assignment recommendations based on guest preferences, relevant upsell opportunities aligned with trip purpose, welcome amenity suggestions matching interests—enabling personalized service without extensive reservation review. Service department staff access guest context when fulfilling requests—dining preferences informing restaurant recommendations, activity history suggesting spa services, past feedback guiding service approach. Guest services teams view comprehensive guest profiles synthesizing preferences, sentiment signals, and satisfaction patterns informing proactive engagement. Operations managers see performance analytics showing personalization effectiveness, staff utilization of recommendations, and guest satisfaction trends across service areas. General managers access strategic dashboards quantifying satisfaction score improvements, revenue per guest increases, operational efficiency gains, and competitive positioning through superior guest experience delivery.",
                "hint_penalty": 25
            },
            {
                "id": "q2_3",
                "text": "What safeguards and controls give them confidence in the AI's outputs?",
                "criteria": "Recommendation reasoning transparency, guest privacy respect, override capabilities, brand standard alignment, performance validation, feedback incorporation",
                "focus": "Explain recommendation transparency and staff override authority that build operational confidence while respecting hospitality values.",
                "hint_text": "Highlight how the system explains why specific recommendations are suggested based on guest data. Describe staff override authority maintaining service judgment. Explain privacy controls and brand standard alignment ensuring appropriateness.",
                "ideal_answer": "Every service recommendation includes transparent reasoning showing which guest preferences, historical behaviors, or contextual factors inform suggestions—staff understand the personalization basis rather than following unexplained guidance. Service teams retain complete authority to apply hospitality judgment, overriding recommendations based on direct guest interaction and situational context, with the system learning from these decisions. Guest privacy controls ensure data use respects preferences and regulatory requirements, with transparent policies about personalization data and opt-out capabilities. Brand standard alignment mechanisms ensure recommendations reflect property positioning and service culture. Performance tracking validates that personalization improves satisfaction and revenue rather than creating unwanted pressure, with feedback loops enabling continuous refinement based on guest response and staff experience, building confidence through demonstrated enhancement of hospitality excellence.",
                "hint_penalty": 25
            }
        ]
    },
    "3": {
        "id": "phase_3",
        "name": "Phase 3: Execution & Scale",
        "description": "Outline the roadmap for success, evidence of performance, and the support model for organizational-wide rollout.",
        "weight": 0.4,
        "time_limit_seconds": 600,
        "contributors": "General Manager, VP of Guest Experience, Operations Director, Head of Loyalty",
        "questions": [
            {
                "id": "q3_1",
                "text": "What does success look like at 90 days, 6 months, and 12 months?",
                "criteria": "Pilot property validation, brand-wide expansion, portfolio deployment, organizational capability building, measurable experience transformation",
                "focus": "Map pilot property validation milestones toward enterprise-wide personalized guest experience transformation.",
                "hint_text": "Define progression from pilot property with validated satisfaction improvement to brand-wide deployment to organization-wide personalization standard. Show evolution from tactical service enhancement to strategic experience differentiation capability.",
                "ideal_answer": "At the initial milestone, success means validating personalization impact at pilot properties with measurable guest satisfaction improvement, documented staff adoption of recommendations, and initial revenue lift from relevant upsell effectiveness. Expansion phase success involves scaling across the brand or portfolio with comprehensive guest data integration, demonstrated value across diverse property types and guest segments, and personalization embedded in service culture. Full maturity represents the platform functioning as the organization-wide standard for guest experience, with intelligent personalization defining brand positioning and competitive differentiation. Leadership reports substantial satisfaction score improvements strengthening reputation and booking conversion, enhanced revenue per guest through effective personalization, improved staff satisfaction from reduced decision burden, and market-leading guest experience that commands pricing premium and drives loyalty program effectiveness, transforming hospitality delivery and competitive positioning.",
                "hint_penalty": 25
            },
            {
                "id": "q3_2",
                "text": "What evidence do we have that this works for companies like them?",
                "criteria": "Hospitality segment relevance, property scale similarity, validated satisfaction metrics, revenue impact documentation, industry recognition",
                "focus": "Reference comparable hospitality environment results and independently validated guest satisfaction improvements.",
                "hint_text": "Mention deployments in similar hospitality properties with comparable guest profiles. Describe validated satisfaction improvements and revenue per guest increases. Reference industry awards or guest review platform recognition of experience quality.",
                "ideal_answer": "The platform has proven success in hospitality environments similar to yours, with documented implementations across hotels and resorts serving comparable guest segments and offering similar service complexity. Reference properties report measurable guest satisfaction improvements reflected in review scores and direct feedback, with outcomes validated through guest survey data and repeat visit patterns. Revenue per guest increases have been documented through reservation system analysis confirming upsell effectiveness. Several properties have received industry recognition for guest experience excellence and innovation in personalized service delivery. The approach has delivered consistent results across diverse hospitality contexts—luxury resorts, business hotels, boutique properties—demonstrating effectiveness across different brand positioning and service models. Hospitality references are available to discuss their transformation to intelligent personalization, the cultural change that enabled staff adoption, and the competitive advantage they have gained through superior guest experience.",
                "hint_penalty": 25
            },
            {
                "id": "q3_3",
                "text": "How will we support them through adoption and scale?",
                "criteria": "Dedicated implementation support, staff training programs, technical assistance accessibility, continuous personalization optimization, executive success reviews",
                "focus": "Outline dedicated hospitality team support and comprehensive property staff enablement programs.",
                "hint_text": "Detail implementation support from hospitality operations and guest experience experts. Describe staff training on using personalization guidance. Explain continuous recommendation refinement and regular reviews tracking satisfaction and revenue impact.",
                "ideal_answer": "Your hospitality team receives dedicated implementation support from specialists combining data science expertise and hotel operations experience, configuring personalization for your specific brand positioning, guest segments, and service culture. Comprehensive training prepares front desk, concierge, dining, and service staff to leverage personalization guidance effectively while maintaining authentic hospitality, with practical sessions addressing real guest scenarios. Property leadership learns to interpret performance analytics and reinforce personalization adoption. Continuous technical support provides rapid assistance whenever questions arise during guest interactions. Regular optimization sessions analyze personalization effectiveness, refine recommendations based on guest response patterns and staff feedback, and identify new opportunities to enhance experience differentiation. Executive business reviews track satisfaction metrics, revenue impact, operational efficiency gains, and competitive positioning, ensuring leadership maintains visibility into how intelligent personalization is strengthening guest experience excellence and financial performance.",
                "hint_penalty": 25
            }
        ]
    }
}
