{
    "1": {
        "id": "phase_1",
        "name": "Phase 1: Market Fit & Strategy",
        "description": "Define the critical pain points, unique value proposition, and competitive advantage of EG's education AI solution.",
        "weight": 0.3,
        "time_limit_seconds": 600,
        "contributors": "Dean of Student Success, Academic Advisors, Registrar, CIO",
        "questions": [
            {
                "id": "q1_1",
                "text": "What specific pain point are we solving that the customer cannot efficiently address today?",
                "criteria": "Reactive intervention timing, at-risk student identification gaps, personalization scalability limitations, engagement signal blindness, resource allocation inefficiency",
                "focus": "Identify the inability to identify struggling students early enough for effective intervention and personalize support at scale.",
                "hint_text": "Describe how academic advisors discover students at risk only after grades drop or attendance becomes problematic. Mention the impossibility of monitoring hundreds of students individually for early warning signs. Explain the generic intervention approaches that don't address individual student needs effectively.",
                "ideal_answer": "Educational institutions struggle with fundamentally reactive student support, discovering learners at risk only after academic performance has already declined significantly—poor exam grades, missed assignments, deteriorating attendance—when intervention effectiveness is substantially reduced. Advisors and faculty cannot monitor engagement signals across hundreds of students individually, missing early indicators like decreasing learning management system activity, declining assignment quality patterns, or reduced peer interaction that predict future struggles. Support interventions remain generic rather than personalized, applying standardized approaches that may not address individual student barriers—financial stress, learning style mismatches, course prerequisite gaps, or personal circumstances affecting success. This reactive approach results in lower retention rates as students disengage before receiving effective support, decreased graduation rates from accumulated academic setbacks, and inefficient resource deployment focusing effort on crisis intervention rather than proactive engagement.",
                "hint_penalty": 25
            },
            {
                "id": "q1_2",
                "text": "What measurable value will the customer realize, and how quickly?",
                "criteria": "Retention rate improvement, intervention effectiveness enhancement, advisor efficiency gains, student outcome improvement, early identification acceleration",
                "focus": "Quantify early identification impact on retention and the speed of student success improvement with advisor efficiency benefits.",
                "hint_text": "Focus on how early at-risk identification enables timely intervention before students fall too far behind. Mention personalized recommendations helping advisors tailor support effectively. Emphasize both retention improvement and advisor efficiency from prioritized outreach.",
                "ideal_answer": "Student success teams experience measurable impact as early warning signals identify at-risk learners weeks or months before academic crisis, enabling proactive outreach when interventions prove most effective. Advisors receive prioritized student lists with personalized intervention recommendations based on specific risk factors—academic preparation gaps requiring tutoring, financial concerns needing aid guidance, engagement patterns suggesting mentoring—allowing targeted support rather than generic approaches. The dual benefit manifests as improved retention rates from timely interventions and enhanced advisor efficiency from focusing effort on students genuinely needing support rather than broad outreach with limited impact. Student outcomes improve as personalized support addresses individual barriers effectively, and institutional metrics strengthen through higher retention, improved graduation rates, and enhanced student satisfaction demonstrating commitment to success.",
                "hint_penalty": 25
            },
            {
                "id": "q1_3",
                "text": "Why is EG the right partner? What differentiates EG?",
                "criteria": "Higher education AI specialization, multi-signal pattern recognition, personalized intervention intelligence, privacy-conscious architecture, student success domain expertise",
                "focus": "Highlight education domain expertise and personalized intervention capabilities that generic analytics platforms cannot deliver.",
                "hint_text": "Highlight AI trained specifically on student success patterns versus generic analytics dashboards. Contrast multi-signal engagement analysis with simple grade monitoring. Emphasize personalized intervention recommendations and privacy-protective design meeting educational regulations.",
                "ideal_answer": "The solution delivers superior prediction accuracy through AI purpose-built for higher education contexts, trained on diverse student populations and institutional types rather than generic analytics adapted for education. Unlike basic dashboards displaying lagging indicators like grades, the platform analyzes complex engagement patterns across learning management systems, attendance data, assignment submissions, peer interactions, and institutional resource utilization—identifying risk signatures before academic performance declines. The differentiation extends to personalized intervention intelligence, not just identifying at-risk students but recommending specific support strategies based on individual circumstances and proven effectiveness patterns. Privacy-conscious architecture ensures student data protection meeting educational regulations while enabling predictive insights. Deep higher education expertise ensures implementation aligns with advising workflows, academic calendars, and student support service structures that characterize institutional operations.",
                "hint_penalty": 25
            }
        ]
    },
    "2": {
        "id": "phase_2",
        "name": "Phase 2: Product & Experience",
        "description": "Detail the integration, user journey, and trust mechanisms that ensure user adoption and confidence.",
        "weight": 0.3,
        "time_limit_seconds": 600,
        "contributors": "Dean of Student Success, Academic Advisors, Registrar, CIO",
        "questions": [
            {
                "id": "q2_1",
                "text": "How does the solution integrate into their existing workflows and systems?",
                "criteria": "Student information system connectivity, learning management integration, advising platform compatibility, engagement data ingestion, privacy compliance architecture",
                "focus": "Detail seamless connection to existing campus systems and early alert delivery within current advising workflows.",
                "hint_text": "Explain connections to student information systems, learning management platforms, and advising tools. Mention automatic ingestion of engagement signals while maintaining privacy standards. Describe how risk alerts flow directly into advisor dashboards and case management systems.",
                "ideal_answer": "The platform integrates seamlessly with existing student information systems, learning management platforms, and advising software through standard educational technology connectors, automatically ingesting academic records, course engagement data, and institutional resource utilization without manual data transfers. Privacy-protective architecture ensures student data remains secure while enabling predictive insights, with role-based access controls respecting institutional policies. Early alert notifications flow directly into advising dashboards and case management tools advisors use daily, eliminating separate monitoring systems. Integration with communication platforms enables personalized outreach through channels students prefer, and the architecture synchronizes with academic calendars to align interventions with institutional rhythms like registration periods or exam schedules, ensuring student success teams work within familiar workflows and established practices.",
                "hint_penalty": 25
            },
            {
                "id": "q2_2",
                "text": "What does the user experience look like for different stakeholders or personas at the customer?",
                "criteria": "Advisor alert actionability, faculty early warning visibility, student success coordinator oversight, administrator outcome reporting, student-facing communication appropriateness",
                "focus": "Compare actionable advisor intervention recommendations with strategic administrator retention and outcome dashboards.",
                "hint_text": "Describe prioritized student alerts for advisors with personalized intervention suggestions versus retention analytics for administrators. Explain faculty early warning tools and student success coordinator population-level insights showing systematic barriers.",
                "ideal_answer": "Academic advisors receive prioritized student alerts with specific risk factors identified and personalized intervention recommendations—which students need immediate outreach, what barriers they face, and which support resources address their specific needs—enabling effective engagement without extensive investigation. Faculty access early warning tools highlighting students in their courses showing concerning engagement patterns, facilitating timely check-ins. Student success coordinators view population-level analytics identifying systemic barriers affecting student cohorts, informing programmatic improvements beyond individual interventions. Administrators see strategic dashboards quantifying retention rate trends, intervention effectiveness, at-risk student identification timing, and outcome improvements across departments and student populations. Communication to students remains appropriate and supportive, avoiding stigmatizing language while encouraging proactive resource utilization and maintaining student agency in their educational journey.",
                "hint_penalty": 25
            },
            {
                "id": "q2_3",
                "text": "What safeguards and controls give them confidence in the AI's outputs?",
                "criteria": "Risk factor transparency, prediction confidence indication, privacy protection verification, bias monitoring, human judgment primacy, student consent respect",
                "focus": "Explain risk factor transparency and human judgment primacy that build institutional confidence while respecting student privacy.",
                "hint_text": "Highlight how the system shows which engagement patterns are indicating risk for each student. Describe advisor override authority and human relationship primacy. Explain ongoing bias monitoring ensuring fairness across student demographics and privacy protections meeting educational regulations.",
                "ideal_answer": "Every student risk assessment includes transparent explanation showing which specific engagement signals, academic patterns, or resource utilization trends are indicating concern—advisors understand the reasoning rather than accepting unexplained scores. Risk levels include confidence indicators, and advisors retain complete authority to apply professional judgment based on their relationship knowledge and student conversations. The system supports rather than replaces human relationships, providing information to enhance advisor effectiveness while maintaining the personal connection central to student support. Ongoing monitoring ensures predictions don't reflect demographic bias, with regular analysis confirming fairness across student populations. Privacy protections meet educational regulations, with clear policies about data usage, student consent where appropriate, and transparent communication about how predictive insights support institutional commitment to student success without surveillance.",
                "hint_penalty": 25
            }
        ]
    },
    "3": {
        "id": "phase_3",
        "name": "Phase 3: Execution & Scale",
        "description": "Outline the roadmap for success, evidence of performance, and the support model for organizational-wide rollout.",
        "weight": 0.4,
        "time_limit_seconds": 600,
        "contributors": "Dean of Student Success, Academic Advisors, Registrar, CIO",
        "questions": [
            {
                "id": "q3_1",
                "text": "What does success look like at 90 days, 6 months, and 12 months?",
                "criteria": "Pilot cohort validation, campus-wide expansion, multi-year longitudinal impact, organizational culture transformation, measurable outcome improvement",
                "focus": "Map pilot cohort validation milestones toward institution-wide proactive student success culture transformation.",
                "hint_text": "Define progression from pilot cohort with validated prediction accuracy to campus-wide deployment to institutional student success standard. Show evolution from tactical intervention to strategic culture of proactive support and continuous improvement.",
                "ideal_answer": "At the initial milestone, success means validating the approach with a pilot student cohort, demonstrating measurable early identification improvement, documented advisor confidence in recommendations, and initial retention impact. Expansion phase success involves scaling across the full student population, with predictive insights fully integrated into advising workflows and demonstrated effectiveness across diverse student demographics and academic programs. Full maturity represents the platform functioning as the institution-wide standard for student success, with proactive support culture embedded organizationally. Leadership reports substantial retention rate improvement, enhanced graduation rates, improved advisor efficiency enabling deeper relationship building, and strengthened institutional reputation for student support excellence. The capability becomes strategic differentiation attracting enrollment through demonstrated commitment to student success and outcomes that validate institutional educational mission.",
                "hint_penalty": 25
            },
            {
                "id": "q3_2",
                "text": "What evidence do we have that this works for companies like them?",
                "criteria": "Institutional type relevance, student population similarity, validated outcome metrics, research validation, education sector recognition",
                "focus": "Reference comparable institution results and independently validated retention and outcome improvements.",
                "hint_text": "Mention deployments in similar institutions with comparable student populations. Describe validated retention improvements and student outcome enhancements. Reference educational research validation or sector recognition of results.",
                "ideal_answer": "The platform has proven success at institutions similar to yours, with documented implementations across colleges and universities serving comparable student populations and facing similar retention challenges. Reference institutions report measurable retention rate improvements and enhanced graduation rates, with outcomes validated through institutional research confirming statistical significance. Several implementations have contributed to educational research literature on early intervention effectiveness and been recognized by higher education associations for student success innovation. The approach has delivered consistent results across diverse institutional contexts—community colleges, regional universities, specialized institutions—demonstrating effectiveness across different educational missions and student demographics. Institutional references are available to discuss their implementation experience, the cultural change management that drove adoption across faculty and staff, and the transformative impact on student outcomes and institutional performance.",
                "hint_penalty": 25
            },
            {
                "id": "q3_3",
                "text": "How will we support them through adoption and scale?",
                "criteria": "Dedicated implementation support, advisor training programs, faculty engagement facilitation, technical assistance accessibility, continuous optimization process, outcome tracking reviews",
                "focus": "Outline dedicated higher education team support and comprehensive campus community enablement programs.",
                "hint_text": "Detail implementation support from higher education student success experts. Describe advisor and faculty training programs. Explain continuous prediction refinement and regular outcome reviews tracking retention impact and student success metrics.",
                "ideal_answer": "Your student success team receives dedicated implementation support from specialists combining data science expertise and higher education advising experience, configuring the system for your specific student population characteristics and institutional support structures. Comprehensive training prepares advisors to interpret risk indicators and leverage personalized recommendations effectively, with practical sessions addressing common student scenarios. Faculty engagement sessions explain early warning tools and appropriate intervention approaches respecting instructional autonomy. Continuous technical support provides rapid assistance whenever questions arise during advising interactions. Regular optimization sessions analyze prediction performance, refine models based on your evolving student population, and incorporate feedback from advisor experiences to improve recommendation relevance. Outcome reviews track retention metrics, intervention effectiveness, advisor efficiency, and student satisfaction, ensuring leadership maintains visibility into how predictive student success is strengthening educational outcomes and fulfilling institutional mission.",
                "hint_penalty": 25
            }
        ]
    }
}
